require 'csv'

class Journey

  LINE_CDS = [
    99301, # 99301,119,都営大江戸線,トエイオオエドセン,都営大江戸線,,,,139.7137041757577,35.707546227112374,12,0,99301
    99302, # 99302,119,都営浅草線,トエイアサクサセン,都営浅草線,,,,139.75860382724613,35.66226194441651,12,0,99302
    99303, # 99303,119,都営三田線,トエイミタセン,都営三田線,,,,139.7032176242069,35.71883584494032,12,0,99303
    99304, # 99304,119,都営新宿線,トエイシンジュクセン,都営新宿線,,,,139.80940398416863,35.689174794941536,11,0,99304
    28001, # 28001,18,東京メトロ銀座線,ギンザセン,東京メトロ銀座線,F7931D,オレンジ,,139.75720810526002,35.686460950459086,13,0,28001
    28002, # 28002,18,東京メトロ丸ノ内線,マルノウチセン,東京メトロ丸ノ内線,E60012,レッド,,139.70043660044496,35.70518513577206,12,0,28002
    28003, # 28003,18,東京メトロ日比谷線,ヒビヤセン,東京メトロ日比谷線,89A1AD,シルバー,,139.76790012172296,35.69469233873322,12,0,28003
    28004, # 28004,18,東京メトロ東西線,トウザイセン,東京メトロ東西線,00A7DB,スカイブルー,,139.8154913497142,35.68326532976152,11,0,28004
    28005, # 28005,18,東京メトロ千代田線,チヨダセン,東京メトロ千代田線,009933,グリーン,,139.7558611955078,35.723011671551085,12,0,28005
    28006, # 28006,18,東京メトロ有楽町線,ユウラクチョウセン,東京メトロ有楽町線,C5C544,ゴールド,,139.70420434309563,35.73316551916096,11,0,28006
    28008, # 28008,18,東京メトロ半蔵門線,ハンゾウモンセン,東京メトロ半蔵門線,A757A8,パープル,,139.76522714815565,35.68813210626038,12,0,28008
    28009, # 28009,18,東京メトロ南北線,ナンボクセン,東京メトロ南北線,00ADA9,エメラルド,,139.73433187075705,35.71029971840751,12,0,28009
    28010, # 28010,18,東京メトロ副都心線,フクトシンセン,東京メトロ副都心線,BB6633,ブラウン,,139.686663477539,35.731442005432505,12,0,28010
  ].freeze

  def initialize
    @stations_csv = CSV.read('files/station20191227free.csv', headers: true)
  end

  # 運命を決める
  def destiny
    start_station_name = stations.sample['station_name']
    direction = directions.sample
    puts "あなたは今から#{start_station_name}駅から#{direction}方向に向います!!"
  end

  private

  # 動画の対象となる駅一覧
  #
  # @return [array] 駅一覧
  def stations
    target_stations = @stations_csv.select do |station_row|
      LINE_CDS.any? { |lid| station_row['line_cd'] == lid.to_s }
    end
  end

  # 行き先方面の一覧
  #
  # @return [array] 方向一覧
  def directions
    %w[
      上り
      下り
    ]
  end
end

Journey.new.destiny